In [1]:
import numpy as np
import pandas as pd

In [2]:
# 데이터 읽기
survey = pd.read_csv("c:/data/mva/survey.csv")
survey.head(3)

   seq  sex  marriage  age  job  edu  salary
0    1    1         1   21    1    4      60
1    2    1         1   22    5    5     100
2    3    1         1   33    1    4     200

In [3]:
# 평균 구하기
survey["age"].mean()

34.275

In [4]:
# 표준편차 구하기
survey["age"].std()

11.602359397542536

In [6]:
# 범주형 변수로 변환하기
survey["sex"] = survey["sex"].astype("category")
survey["job"] = survey["job"].astype("category")
survey["edu"] = survey["edu"].astype("category")
survey.marriage = survey.marriage.astype("category")

In [7]:
# 연속인 변수의 기술통계량 구하기
survey.iloc[:, 1:].describe()

             age     salary
count  40.000000   40.00000
mean   34.275000  130.22500
std    11.602359   72.19258
min    20.000000   50.00000
25%    24.750000   77.50000
50%    32.000000  105.00000
75%    42.500000  175.00000
max    59.000000  349.00000

In [9]:
# 나이에 대한 평균 및 표준편차
agestat_by_sex = survey.groupby("sex")["age"].describe()
agestat_by_sex

     count       mean        std   min   25%   50%   75%   max
sex
1     27.0  33.962963  11.969453  20.0  24.0  32.0  43.0  59.0
2     13.0  34.923077  11.243232  21.0  26.0  33.0  41.0  56.0

In [10]:
agestat_by_sex["mean"]

sex
1    33.962963
2    34.923077
Name: mean, dtype: float64

In [11]:
agestat_by_sex["std"]

sex
1    11.969453
2    11.243232
Name: std, dtype: float64

In [12]:
# (sex, marriage)를 그룹으로 age의 기술통계량 구하기
agestat_by_sex_marriage = survey.groupby(["sex","marriage"])["age"].describe()
agestat_by_sex_marriage

              count       mean        std   min    25%   50%    75%   max
sex marriage
1   1          10.0  24.800000   4.709329  20.0  21.00  23.5  26.75  33.0
    2          15.0  37.866667  11.230486  22.0  31.00  34.0  46.50  56.0
    3           2.0  50.500000  12.020815  42.0  46.25  50.5  54.75  59.0
2   1           5.0  24.400000   3.209361  21.0  22.00  24.0  26.00  29.0
    2           8.0  41.500000   9.071147  27.0  37.50  41.0  46.75  56.0

In [13]:
agestat_by_sex_marriage["mean"]

sex  marriage
1    1           24.800000
     2           37.866667
     3           50.500000
2    1           24.400000
     2           41.500000
Name: mean, dtype: float64

In [14]:
agestat_by_sex_marriage["std"]

sex  marriage
1    1            4.709329
     2           11.230486
     3           12.020815
2    1            3.209361
     2            9.071147
Name: std, dtype: float64

In [15]:
#빈도표 및 분할표(성별, 교육)
sex_freq = pd.crosstab(index=survey.sex, columns='count')
sex_freq

col_0  count
sex
1         27
2         13

In [16]:
# (sex, edu)의 분할표 구하기
sex_edu_table = pd.crosstab(index=survey.sex, columns=survey.edu)
sex_edu_table

edu  1  2  3   4   5
sex
1    1  1  1  13  11
2    0  0  2   6   5

In [18]:
# (sex, edu)의 분할표–카이제곱 검정
from scipy.stats import chi2_contingency
chi2_contingency(sex_edu_table)
# help(chi2_contingency)

(2.578097665816964,
 0.6307078881367414,
 4,
 array([[ 0.675,  0.675,  2.025, 12.825, 10.8  ],
        [ 0.325,  0.325,  0.975,  6.175,  5.2  ]]))